/* automatically generated by rust-bindgen 0.72.0 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        "Size of max_align_t"
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        "Alignment of max_align_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        "Offset of field: max_align_t::__clang_max_align_nonce1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        "Offset of field: max_align_t::__clang_max_align_nonce2"
    );
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mt_kahypar_hypergraph_type_t {
    STATIC_GRAPH = 0,
    DYNAMIC_GRAPH = 1,
    STATIC_HYPERGRAPH = 2,
    DYNAMIC_HYPERGRAPH = 3,
    NULLPTR_HYPERGRAPH = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mt_kahypar_partition_type_t {
    MULTILEVEL_GRAPH_PARTITIONING = 0,
    N_LEVEL_GRAPH_PARTITIONING = 1,
    MULTILEVEL_HYPERGRAPH_PARTITIONING = 2,
    N_LEVEL_HYPERGRAPH_PARTITIONING = 3,
    LARGE_K_PARTITIONING = 4,
    NULLPTR_PARTITION = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Either success or type of the error."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mt_kahypar_status_t {
    SUCCESS = 0,
    INVALID_INPUT = 1,
    INVALID_PARAMETER = 2,
    UNSUPPORTED_OPERATION = 3,
    SYSTEM_ERROR = 4,
    OTHER_ERROR = 5,
}
#[doc = " Indicates whether an error occured.\n\n If an error occurs, mt_kahypar_free_error_content needs to be called\n afterwards to free the space allocated for the error message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_error_t {
    pub msg: *const ::std::os::raw::c_char,
    pub msg_len: usize,
    pub status: mt_kahypar_status_t,
}
#[test]
fn bindgen_test_layout_mt_kahypar_error_t() {
    const UNINIT: ::std::mem::MaybeUninit<mt_kahypar_error_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mt_kahypar_error_t>(),
        24usize,
        "Size of mt_kahypar_error_t"
    );
    assert_eq!(
        ::std::mem::align_of::<mt_kahypar_error_t>(),
        8usize,
        "Alignment of mt_kahypar_error_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg) as usize - ptr as usize },
        0usize,
        "Offset of field: mt_kahypar_error_t::msg"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_len) as usize - ptr as usize },
        8usize,
        "Offset of field: mt_kahypar_error_t::msg_len"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        16usize,
        "Offset of field: mt_kahypar_error_t::status"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_context_s {
    _unused: [u8; 0],
}
pub type mt_kahypar_context_t = mt_kahypar_context_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_target_graph_s {
    _unused: [u8; 0],
}
pub type mt_kahypar_target_graph_t = mt_kahypar_target_graph_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_hypergraph_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_hypergraph_t {
    pub hypergraph: *mut mt_kahypar_hypergraph_s,
    pub type_: mt_kahypar_hypergraph_type_t,
}
#[test]
fn bindgen_test_layout_mt_kahypar_hypergraph_t() {
    const UNINIT: ::std::mem::MaybeUninit<mt_kahypar_hypergraph_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mt_kahypar_hypergraph_t>(),
        16usize,
        "Size of mt_kahypar_hypergraph_t"
    );
    assert_eq!(
        ::std::mem::align_of::<mt_kahypar_hypergraph_t>(),
        8usize,
        "Alignment of mt_kahypar_hypergraph_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hypergraph) as usize - ptr as usize },
        0usize,
        "Offset of field: mt_kahypar_hypergraph_t::hypergraph"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        "Offset of field: mt_kahypar_hypergraph_t::type_"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_hypergraph_const_t {
    pub hypergraph: *const mt_kahypar_hypergraph_s,
    pub type_: mt_kahypar_hypergraph_type_t,
}
#[test]
fn bindgen_test_layout_mt_kahypar_hypergraph_const_t() {
    const UNINIT: ::std::mem::MaybeUninit<mt_kahypar_hypergraph_const_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mt_kahypar_hypergraph_const_t>(),
        16usize,
        "Size of mt_kahypar_hypergraph_const_t"
    );
    assert_eq!(
        ::std::mem::align_of::<mt_kahypar_hypergraph_const_t>(),
        8usize,
        "Alignment of mt_kahypar_hypergraph_const_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hypergraph) as usize - ptr as usize },
        0usize,
        "Offset of field: mt_kahypar_hypergraph_const_t::hypergraph"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        "Offset of field: mt_kahypar_hypergraph_const_t::type_"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_partitioned_hypergraph_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_partitioned_hypergraph_t {
    pub partitioned_hg: *mut mt_kahypar_partitioned_hypergraph_s,
    pub type_: mt_kahypar_partition_type_t,
}
#[test]
fn bindgen_test_layout_mt_kahypar_partitioned_hypergraph_t() {
    const UNINIT: ::std::mem::MaybeUninit<mt_kahypar_partitioned_hypergraph_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mt_kahypar_partitioned_hypergraph_t>(),
        16usize,
        "Size of mt_kahypar_partitioned_hypergraph_t"
    );
    assert_eq!(
        ::std::mem::align_of::<mt_kahypar_partitioned_hypergraph_t>(),
        8usize,
        "Alignment of mt_kahypar_partitioned_hypergraph_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).partitioned_hg) as usize - ptr as usize },
        0usize,
        "Offset of field: mt_kahypar_partitioned_hypergraph_t::partitioned_hg"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        "Offset of field: mt_kahypar_partitioned_hypergraph_t::type_"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mt_kahypar_partitioned_hypergraph_const_t {
    pub partitioned_hg: *const mt_kahypar_partitioned_hypergraph_s,
    pub type_: mt_kahypar_partition_type_t,
}
#[test]
fn bindgen_test_layout_mt_kahypar_partitioned_hypergraph_const_t() {
    const UNINIT: ::std::mem::MaybeUninit<mt_kahypar_partitioned_hypergraph_const_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mt_kahypar_partitioned_hypergraph_const_t>(),
        16usize,
        "Size of mt_kahypar_partitioned_hypergraph_const_t"
    );
    assert_eq!(
        ::std::mem::align_of::<mt_kahypar_partitioned_hypergraph_const_t>(),
        8usize,
        "Alignment of mt_kahypar_partitioned_hypergraph_const_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).partitioned_hg) as usize - ptr as usize },
        0usize,
        "Offset of field: mt_kahypar_partitioned_hypergraph_const_t::partitioned_hg"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        "Offset of field: mt_kahypar_partitioned_hypergraph_const_t::type_"
    );
}
pub type mt_kahypar_hypernode_id_t = ::std::os::raw::c_ulong;
pub type mt_kahypar_hyperedge_id_t = ::std::os::raw::c_ulong;
pub type mt_kahypar_hypernode_weight_t = ::std::os::raw::c_int;
pub type mt_kahypar_hyperedge_weight_t = ::std::os::raw::c_int;
pub type mt_kahypar_partition_id_t = ::std::os::raw::c_int;
#[repr(u32)]
#[non_exhaustive]
#[doc = " Configurable parameters of the partitioning context."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mt_kahypar_context_parameter_type_t {
    NUM_BLOCKS = 0,
    EPSILON = 1,
    OBJECTIVE = 2,
    NUM_VCYCLES = 3,
    VERBOSE = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Supported objective functions."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mt_kahypar_objective_t {
    CUT = 0,
    KM1 = 1,
    SOED = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Preset types for partitioning context."]
